{
  "BraitenbregHuskyGeneva":{
    "experimentConfiguration": "ExDConf/ExDXMLExample.xml",
    "imageUrl": "img/common/preview_Braitenberg_Husky.png",
    "name": "Husky Braitenberg experiment (Geneva, no camera)",
    "snippet": "This experiment loads the Husky robot from Clearpath Robotics and the virtual room environment. If the user starts the experiment, the Braitenberg vehicle network is executed and the robot will turn around itself in place.",
    "timeout": 600,
    "serverPattern": "bbpce"
  },
  "BraitenbregLauronGeneva":{
    "experimentConfiguration": "ExDConf/ExDBraitenbergLauron.xml",
    "imageUrl": "img/common/preview_Braitenberg_Lauron.png",
    "name": "LAURON V Braitenberg experiment (Geneva, no camera)",
    "snippet": "This experiment loads the six-legged walking robot LAURON V (developed at FZI) and the virtual room environment. If the user starts the experiment, the Braitenberg vehicle network is executed and the robot will turn around itself in place.",
    "timeout": 600,
    "serverPattern": "bbpce"
  },
  "BraitenbregHuskyLugano":{
    "experimentConfiguration": "ExDConf/ExDXMLExample.xml",
    "imageUrl": "img/common/preview_Braitenberg_Husky.png",
    "name": "Husky Braitenberg experiment (Lugano)",
    "snippet": "This experiment loads the Husky robot from Clearpath Robotics and the virtual room environment. If the user starts the experiment, the Braitenberg vehicle network is executed and the robot will turn around itself in place, until the camera detects a red color. Then, the robot will move towards the colored object. In this experiment, the user can interact and change the color of both screens by clicking on them with the right mouse button.",
    "timeout": 600,
    "serverPattern": "bbpsrvc"
  },
  "BraitenbregLauronLugano":{
    "experimentConfiguration": "ExDConf/ExDBraitenbergLauron.xml",
    "imageUrl": "img/common/preview_Braitenberg_Lauron.png",
    "name": "LAURON V Braitenberg experiment (Lugano)",
    "snippet": "This experiment loads the six-legged walking robot LAURON V (developed at FZI) and the virtual room environment. If the user starts the experiment, the Braitenberg vehicle network is executed and the robot will turn around itself in place, until the camera detects a red color. Then, the robot will move towards the colored object. In this experiment, the user can interact and change the color of both screens by clicking on them with the right mouse button.",
    "timeout": 600,
    "serverPattern": "bbpsrvc"
  }
}
